SampleXml/Sample_Get_Applicants_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsse='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd'>
  <soapenv:Header>
    <wd:Workday_Common_Header xmlns:wd='urn:com.workday/bsvc'>
      <wd:Include_Reference_Descriptors_In_Response>true</wd:Include_Reference_Descriptors_In_Response>
    </wd:Workday_Common_Header>
    <wsse:Security soapenv:mustUnderstand='1'>
      <wsse:UsernameToken>
        <wsse:Username>abintegrationsuser@accurate_dpt1</wsse:Username>
        <wsse:Password 
            Type='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText'>hUcracuG3zUfre@uzudatuFu</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <wd:Get_Applicants_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v28.1">
      <wd:Request_References>
        <wd:Applicant_Reference>
          <wd:ID wd:type="Applicant_ID">A04825</wd:ID>
        </wd:Applicant_Reference>
      </wd:Request_References>
    </wd:Get_Applicants_Request>
  </soapenv:Body>
</soapenv:Envelope>